<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"298f4ddb07c3d74d00301026048f0e90ebf5f25715ebdeb97be69964a593ec3d","plan_job_ref":"Job Create MPE Management terraform plan #53 at https://github.com/AFMPE/mpe_management/actions/runs/7834933895","plan_hash":"e1acb3c9d4fbaa627bd629043674802da5b8086dab5036f3df56329a6c127151","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=ampev2            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
subscription_id_codex    = (sensitive value)
subscription_id_dev      = (sensitive value)
subscription_id_devlab   = (sensitive value)
subscription_id_forensic = (sensitive value)
subscription_id_hub      = (sensitive value)
subscription_id_identity = (sensitive value)
subscription_id_sandbox  = (sensitive value)
subscription_id_security = (sensitive value)
vm_admin_password        = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_virtual_machine_data_disk_attachment.data_disk["disk1"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data_disk" {
      + caching                   = "ReadWrite"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = "*******************************************************************************************************************************************************"
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_virtual_machine_extension.omsagentwin[0] will be created
  + resource "azurerm_virtual_machine_extension" "omsagentwin" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "OmsAgentForWindows"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                    = <<-EOT
            {
                  "workspaceId": "f4a6b291-6836-4823-8dba-d73fa97701fa"
                }
        EOT
      + type                        = "MicrosoftMonitoringAgent"
      + type_handler_version        = "1.0"
      + virtual_machine_id          = (known after apply)
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_windows_virtual_machine.win_vm[0] will be created
  + resource "azurerm_windows_virtual_machine" "win_vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "ampe-eus-977c6b"
      + enable_automatic_updates                               = false
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = false
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "ampe-eus-jmp-prod-vm"
      + network_interface_ids                                  = [
          + "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-devsecops-prod-rg/providers/Microsoft.Network/networkInterfaces/ampe-eus-jmp-prod-nic",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ampe-eus-devsecops-prod-rg"
      + size                                                   = "Standard_D2_v2"
      + tags                                                   = {
          + "ResourceName" = "ampe-eus-jmp-pr"
          + "deployedBy"   = "AzureNoOpsTF"
        }
      + virtual_machine_id                                     = (known after apply)

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #53](https://github.com/AFMPE/mpe_management/actions/runs/7834933895)